app/controllers/home_controller.rb

	def index
		@person = Person.new
		@user = User.last
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]

	def register
		unless params[:search].nil?
			@vehicle = Vehicle.search(params[:search])
---
SELECT  "vehicles".* FROM "vehicles" WHERE (plate LIKE '%rr%') LIMIT $1  [["LIMIT", 1]]