app/controllers/payments_controller.rb

  def index
    @payments = Payment.all
---
SELECT "payments".* FROM "payments"

  def create
    @payment = Payment.new(payment_params)
    $payment = @payment
    respond_to do |format|
      if @payment.save
---
INSERT INTO "payments" ("numcard", "name_owner", "expiry_date", "code", "dues_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_payment
      @payment = Payment.find(params[:id])
---
SELECT  "payments".* FROM "payments" WHERE "payments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]