app/controllers/purchases_controller.rb

SELECT "purchases".* FROM "purchases"
---
  def index
    @purchases = Purchase.all

DELETE FROM "purchases" WHERE "purchases"."id" = $1  [["id", 2]]
---
  def destroy
    @purchase.destroy

SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_purchase
      @purchase = Purchase.find(params[:id])