app/controllers/vehicles_controller.rb

  def index
    @vehicles = Vehicle.all
---
SELECT "vehicles".* FROM "vehicles"

  def create
    @vehicle = Vehicle.new(vehicle_params)
    respond_to do |format|
      $vehicle = @vehicle
      if @vehicle.save
---
INSERT INTO "vehicles" ("plate", "vehicle_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["plate", "drt5436"], ["vehicle_type_id", 1], ["created_at", "2017-07-14 00:30:46.374731"], ["updated_at", "2017-07-14 00:30:46.374731"]]

  def destroy
    @vehicle.destroy
---
DELETE FROM "vehicles" WHERE "vehicles"."id" = $1  [["id", 2]]

    def set_vehicle
      @vehicle = Vehicle.find(params[:id])
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]