app/controllers/vehicle_types_controller.rb

  def index
    @vehicle_types = VehicleType.all
---
SELECT "vehicle_types".* FROM "vehicle_types"

  def create
    @vehicle_type = VehicleType.new(vehicle_type_params)

    respond_to do |format|
      if @vehicle_type.save
---
INSERT INTO "vehicle_types" ("code", "name", "subtype", "year", "tax", "prime", "fosyga", "runt", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    respond_to do |format|
      if @vehicle_type.update(vehicle_type_params)
---
UPDATE "vehicle_types" SET "code" = $1, "updated_at" = $2 WHERE "vehicle_types"."id" = $3  [["code", 110], ["updated_at", "2017-07-15 21:36:16.304393"], ["id", 1]]

    def set_vehicle_type
      @vehicle_type = VehicleType.find(params[:id])
---
SELECT  "vehicle_types".* FROM "vehicle_types" WHERE "vehicle_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]