app/views/vehicles/_form.html.erb

    <%= f.label :Tipo_de_Vehiculo %>
    <%= f.collection_select :vehicle_type_id, VehicleType.order(:name), :id, :name, validate: true,:prompt=>"Seleccione"  %>
---
SELECT "vehicle_types".* FROM "vehicle_types" ORDER BY "vehicle_types"."name" ASC